long CalcCount(int[,] matrix)
{
    long count = 0;

    for (int row = 0; row < matrix.GetLength(0); row++)
    {   
    	if (matrix[row, 0] % 2 == 0)
    	{
            for (int col = 0; col < matrix.GetLength(1); col++)
            {
                if (matrix[row,col] > 0)
                {
                    count++;
                }
            }
        }
    }

    return count;
}

/**
 * Сложността на алгоритъма е квадратична или O(n*m)
 * При в ходни данни от "n" на брой външният for цикъл ще се изпълни от порядъка "n" пъти.
 * При в ходни данни от "m" на брой вътрешният for цикъл  ще се изпълни от порядъка "m" пъти по
 * по броя на четните числа в първа колона. В най-лошия случай цикъла ще се изпълни m*n пъти
 * От където следва, че сложноста му е O(m*n) 
 */